import 'package:hive/hive.dart';

class NewsData {
  static Future<void> addData() async {
    // Hive.box<News>(Boxes.news).addAll(
    //   [
    //     News(
    //       photo: 'assets/images/news/i1.png',
    //       title: 'Страстная седмица стартовала',
    //       subTitle: 'что можно и что категорически нельзя делать в эти дни',
    //       content: [
    //         '[IMAGE]assets/images/news/n1.png',
    //         '[DATE]',
    //         '[TITLE]Страстная седмица стартовала',
    //         '[TEXT]Весь этот период верующие вспоминают последние дни земной жизни Иисуса Христа, его страдания на Кресте, смерть и погребение.',
    //         '[TEXT]Каждый из дней Страстной недели православные проводят в усиленных молитвах.',
    //         '[SUBTITLE]Великий Понедельник',
    //         '[TEXT]По преданию, в этот день Иисус приказал смоковнице (инжир) засохнуть и больше не плодоносить, что трактуется как непрощение нераскаявшейся душе.',
    //         '[TEXT]Также сегодня Церковь вспоминает патриарха Иосифа, которого родные братья продали в рабство из зависти.',
    //         '[TEXT]Вспоминают и 9 христиан, которых за их веру замучили в III веке в городе Кизик.',
    //         '[TEXT]Великий Понедельник традиционно посвящали началу масштабных уборочных работ по дому, а также на своем дворе.',
    //         '[TEXT]Возбраняется в сей день предаваться шумным забавам, ругаться, ссориться и ходить по гостям.',
    //       ],
    //       date: DateTime(2024, 07, 01),
    //     ),
    //     News(
    //       photo: 'assets/images/news/i2.png',
    //       title: 'Народные приметы на 24 июня 2024 года',
    //       subTitle: 'май будет дождливый или солнечный',
    //       content: [
    //         '[IMAGE]assets/images/news/n2.png',
    //         '',
    //       ],
    //       date: DateTime(2024, 06, 24),
    //     ),
    //     News(
    //       photo: 'assets/images/news/i3.png',
    //       title: 'Татарский праздник Сабантуй:',
    //       subTitle: 'история и традиции',
    //       content: [
    //         '[IMAGE]assets/images/news/n3.png',
    //         '',
    //       ],
    //       date: DateTime(2024, 06, 30),
    //     ),
    //     News(
    //       photo: 'assets/images/news/i4.png',
    //       title: 'Песах - иудейская пасха',
    //       subTitle: 'Песах – наиболее почитаемый иудейский праздник. ',
    //       content: [
    //         '[IMAGE]assets/images/news/n4.png',
    //       ],
    //       date: DateTime(2024, 04, 22),
    //     ),
    //     News(
    //       photo: 'assets/images/news/i5.png',
    //       title: 'Как покрасить яйца к Пасхе:',
    //       subTitle: 'традиционные и оригинальные способы',
    //       content: [
    //         '[IMAGE]assets/images/news/n5.png',
    //         '',
    //       ],
    //       date: DateTime(2024, 04, 22),
    //     ),
    //   ],
    // );
  }
}
